package main

import "fmt"

// 演示管道的使用
func main() {
	//channel本质就是一个数据结构-队列
	//数据是先进先出
	//线程安全，多goroutine访问时不需要加锁
	//channel是有类型的，一个string类型channel只能存放string类型数据
	//管道里面的数据可以只取不接收
	var intChan chan int //定义方式比较特殊 var 名字 chan 存放类型
	//注意管道为引用类型，使用前必须make
	intChan = make(chan int, 10) //管道类型不能自动增加容量,当超出容量时候会报错，死锁
	intChan <- 10
	num := 2121
	intChan <- num
	fmt.Println(len(intChan), cap(intChan)) //2 10

	//取出数据符合先进先出，但容量不变
	num1 := <-intChan
	fmt.Println(num1)
	close(intChan)
	//在没有使用协程的情况下，如果我们管道数据已经全部取出，再取也会报错，死锁

	//使用空接口管道可能会用到类型断言
	//类型断言是Go语言中用于在接口类型和具体类型之间进行转换的操作。它的核心作用是检查接口值底层持有的具体类型，并在安全的情况下将其转换为该类型。
	// 📌 基本语法
	//两种语法形式
	// value, ok := interfaceValue.(Type)  安全型，推荐使用
	// value := interfaceValue.(Type)      直接型，失败会panic

	//channel的关闭
	//使用内置函数close可以关闭channel,关闭后就不能在向channel中写数据了，但是仍然可以读数据
	//channel的遍历
	//支持for-range关闭 但是注意如果channel如果没有关闭，会出现deadlock for可以不关闭

	//channel可以声明只读只写的属性
	//var cham1 <-chan int = make(chan int, 10) //箭头只代表属性，不代表类型

	//当不知道什么时候close通道的时候，可以用select-case、recover解决
}
